doc/html/_static/soap_outputs/6.2.314.3321/deploy_action_with_params_against_windows_computers_step_6_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <action>
          <comment>Created by PyTan v2.1.0</comment>
          <status>0</status>
          <distribute_seconds>0</distribute_seconds>
          <start_time>2015-09-05T05:20:37</start_time>
          <id>-1</id>
          <expire_seconds>660</expire_seconds>
          <name>API Deploy Custom Tagging - Add Tags</name>
          <package_spec>
            <expire_seconds>660</expire_seconds>
            <display_name>Custom Tagging - Add Tags</display_name>
            <name>Custom Tagging - Add Tags</name>
            <verify_group_id>0</verify_group_id>
            <last_modified_by>Jim Olsen</last_modified_by>
            <last_update>2015-08-07T11:46:55</last_update>
            <source_id>31</source_id>
            <hidden_flag>1</hidden_flag>
            <command>cmd /c cscript //T:60 add-tags.vbs "$1"</command>
            <command_timeout>60</command_timeout>
            <parameter_definition>{"parameters":[{"maxChars":0,"validationExpressions":[{"expression":"\\S","helpString":"You must enter a value","flags":"","model":"com.tanium.models::ValidationExpression","parameterType":"com.tanium.models::ValidationExpression"}],"label":"Add tags (space-delimited)","key":"$1","restrict":null,"value":"","helpString":"Enter tags space-delimited.","promptText":"e.g. PCI DMZ Decomm","defaultValue":"","parameterType":"com.tanium.components.parameters::TextInputParameter","model":"com.tanium.components.parameters::TextInputParameter"}],"model":"com.tanium.components.parameters::ParametersArray","parameterType":"com.tanium.components.parameters::ParametersArray"}</parameter_definition>
            <parameters>
              <parameter>
                <value>tag_should_be_added</value>
                <key>$1</key>
              </parameter>
              <parameter>
                <value>tag_should_be_ignore</value>
                <key>$2</key>
              </parameter>
            </parameters>
            <metadata>
              <item>
                <admin_flag>0</admin_flag>
                <name>defined</name>
                <value>Tanium</value>
              </item>
              <item>
                <admin_flag>0</admin_flag>
                <name>category</name>
                <value>Tanium</value>
              </item>
            </metadata>
          </package_spec>
          <target_group>
            <filters>
              <filter>
                <not_flag>0</not_flag>
                <value>.*Windows.*</value>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>45421433</hash>
                </sensor>
              </filter>
            </filters>
          </target_group>
        </action>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>